InformationRegisters/ЗаказыТорговыхПлощадок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗаказыТорговыхПлощадок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиМаркетплейсов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовТорговыхПлощадок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияПриОбменеСТорговымиПлощадками</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСкладаТорговойПлощадки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРодительскогоОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСкладаТорговойПлощадки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяЗаполнениеСведенийПоТоварам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПолучениеЭтикеток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаданияПолученияЭтикеток</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОтгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказЮридическогоЛица</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИдентификаторОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоТестовыйЗаказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОтгрузки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровХранителю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДополнительныеСведенияПоТоварамЗаказовТорговыхПлощадок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеСведенияПоТоварамЗаказовТорговыхПлощадок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТребуетсяСтранаПроисхождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяНомерГТД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяРНПТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяМаркировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяУИН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихкодУпаковки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйКодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРодительскогоОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОтгрузки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровХранителю</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаПройдена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбъектаМаркетплейса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭкземпляра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыЗаказовТорговыхПлощадок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовТорговыхПлощадок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетСборки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередаетсяВДоставку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринимаетсяВДоставку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятВДоставку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринятВДоставку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Спор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставляется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПунктеВыдачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетОплату</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ЗаказыТорговыхПлощадок/Forms/СоставЗаказа/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УчетнаяЗапись           = Параметры.УчетнаяЗапись;
	ЭтоFBO                  = Параметры.ЭтоFBO;
	ИдентификаторЗаказа     = Параметры.ИдентификаторЗаказа;
	НомерЗаказа             = Параметры.НомерЗаказа;
	КомментарийКЗаказу      = Параметры.КомментарийКЗаказу;
	ДатаОтправления 		= Параметры.ДатаОтправления;
	НомерОтправления        = Параметры.НомерОтправления;
	СтатусОтправления       = Параметры.СтатусОтправления;
	ДатаОтгрузки            = Параметры.ДатаОтгрузки;
	ДатаДоставки            = Параметры.ДатаДоставки;
	ДатаПередачиВДоставку   = Параметры.ДатаПередачиВДоставку;
	СпособДоставки          = Параметры.СпособДоставки;
	ТипДоставки             = Параметры.ТипДоставки;
	СпособОплаты            = Параметры.СпособОплаты;
	ПричинаОтмены           = Параметры.ПричинаОтмены;
	НаименованиеСклада      = Параметры.НаименованиеСклада;
	ТрекНомерОтправления    = Параметры.ТрекНомерОтправления;
	ДокументЗаказа          = Параметры.ДокументЗаказа;
	ДокументОтгрузки        = Параметры.ДокументОтгрузки;
	ДополнительныеСведения  = Параметры.ДополнительныеСведения;
	
	ТорговаяПлощадка = ИнтеграцияСМаркетплейсамиПовтИсп.ВидМаркетплейсаУчетнойЗаписи(УчетнаяЗапись);
	
	ДанныеОГеографииДоставки = Новый Массив;
	Если ЗначениеЗаполнено(Параметры.ГородДоставки) Тогда
		ДанныеОГеографииДоставки.Добавить(Параметры.ГородДоставки);
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.РегионДоставки) Тогда
		ДанныеОГеографииДоставки.Добавить(Параметры.РегионДоставки);
	КонецЕсли;
	ГеографияДоставки = СтрСоединить(ДанныеОГеографииДоставки, ", ");
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Сведения об отправлении <%1> по заказу <%2>'"),
		НомерОтправления,
		НомерЗаказа);
	
	Товары = ПолучитьИзВременногоХранилища(Параметры.АдресСодержимогоЗаказа);
	УдалитьИзВременногоХранилища(Параметры.АдресСодержимогоЗаказа);
	ЗначениеВРеквизитФормы(Товары, "СписокТоваровВОтправлении");
	
	ОбновитьТекстДокументыНаОсновании();
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если (ИмяСобытия = "МП_ВыполненаЗагрузкаЗаказовТорговойПлощадки"
				Или ИмяСобытия = "МП_ВыполненоПодтверждениеСборкиЗаказовНаТорговойПлощадке"
				Или ИмяСобытия = "МП_ВыполненоОткрытиеСпораНаТорговойПлощадке"
				Или ИмяСобытия = "МП_ВыполненВозвратКОтгрузкеНаТорговойПлощадке")
			И Не ЭтоFBO
			И Параметр = УчетнаяЗапись Тогда
		ОпределитьДокументыFBS();
		ОбновитьТекстДокументыНаОсновании();
		
	ИначеЕсли ИмяСобытия = "МП_ВыполненаОтменаСборкиЗаказовНаТорговойПлощадке" И Не ЭтоFBO Тогда
		ПараметрыОповещения = ИнтеграцияСМаркетплейсамиКлиент.НовыеПараметрыОповещенияОбОтменеСборкиЗаказа();
		ЗаполнитьЗначенияСвойств(ПараметрыОповещения, Параметр);
		
		Если ПараметрыОповещения.УчетнаяЗапись = УчетнаяЗапись Тогда
			ПричинаОтмены = ПараметрыОповещения.ПричинаОтмены;
			ОпределитьДокументыFBS();
			ОбновитьТекстДокументыНаОсновании();
		КонецЕсли;
		
	ИначеЕсли (ИмяСобытия = "МП_ОбновлениеСведенийПоЗаказамИОтправлениям"
					Или ИмяСобытия = "Запись_ЗаказКлиента"
					Или ИмяСобытия = "Запись_РеализацияТоваровУслуг"
					Или ИмяСобытия = "Запись_ПередачаТоваровХранителю")
				И Не ЭтоFBO Тогда
		ОпределитьДокументыFBS();
		ОбновитьТекстДокументыНаОсновании();
		
	ИначеЕсли ИмяСобытия = "Запись_НаборКонстант"
				И (Источник = "ИспользоватьЗаказыКлиентов"
					Или Источник = "ИспользоватьРасширенныеВозможностиЗаказаКлиента") Тогда
		УправлениеВидимостьюДоступностью();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТекстДокументыНаОснованииОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьЗаказ" Тогда
		ПоказатьЗначение(Неопределено, ДокументЗаказа);
	
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьДокументОтгрузки" Тогда
		ПоказатьЗначение(Неопределено, ДокументОтгрузки);
	
	ИначеЕсли СтрНайти(НавигационнаяСсылкаФорматированнойСтроки, "ОткрытьДокументОтгрузки") > 0 Тогда
		Индекс = Число(СтрЗаменить(НавигационнаяСсылкаФорматированнойСтроки, "ОткрытьДокументОтгрузки", ""));
		ПоказатьЗначение(Неопределено, ДокументОтгрузки[Индекс].Значение);
	
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ЗаполнитьИРаспределить" Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("УчетнаяЗапись", УчетнаяЗапись);
		ПараметрыФормы.Вставить("Заказ",         ДокументЗаказа);
		ПараметрыФормы.Вставить("НомерЗаказа",   НомерЗаказа);
		
		ОткрытьФорму(
			"РегистрСведений.ДополнительныеСведенияПоТоварамЗаказовТорговыхПлощадок.Форма.ЗаполнениеДанныхЭкземпляров",
			ПараметрыФормы,
			ЭтотОбъект,
			ДокументЗаказа);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументЗаказаПриИзменении(Элемент)
	
	ОбновитьТекстДокументыНаОсновании();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОтгрузкиПриИзменении(Элемент)
	
	ОбновитьТекстДокументыНаОсновании();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеВидимостьюДоступностью()
	
	Элементы.ГруппаРеквизитыFBO.Видимость    = ЭтоFBO;
	Элементы.ГруппаРеквизитыFBS.Видимость    = Не ЭтоFBO;
	Элементы.ГруппаДокументы.Видимость       = Не ЭтоFBO;
	Элементы.ГруппаДанныеОЗаказе.Видимость   = Не ЭтоFBO;
	Элементы.ГруппаКоманднаяПанель.Видимость = Не ЭтоFBO;
	
	Если ЭтоFBO Тогда
		Элементы.ДополнительныеСведения.Видимость = Ложь;
	Иначе
		Если СтатусОтправления = Перечисления.СтатусыЗаказовТорговыхПлощадок.ОжидаетСборки
				Или СтатусОтправления = Перечисления.СтатусыЗаказовТорговыхПлощадок.ГотовКОтгрузке Тогда
			Элементы.ДатаОтгрузки.Видимость          = Истина;
			Элементы.ДатаДоставки.Видимость          = Истина;
			Элементы.ДатаПередачиВДоставку.Видимость = Ложь;
			Элементы.ДатаДоставки1.Видимость         = Ложь;
			Элементы.ПричинаОтмены.Видимость         = Ложь;
			Элементы.ТрекНомерОтправления.Видимость  = Ложь;
		ИначеЕсли СтатусОтправления = Перечисления.СтатусыЗаказовТорговыхПлощадок.Отменен Тогда
			Элементы.ДатаОтгрузки.Видимость          = Ложь;
			Элементы.ДатаДоставки.Видимость          = Ложь;
			Элементы.ДатаПередачиВДоставку.Видимость = Ложь;
			Элементы.ДатаДоставки1.Видимость         = Ложь;
			Элементы.ПричинаОтмены.Видимость         = Истина;
			Элементы.ТрекНомерОтправления.Видимость  = Ложь;
		Иначе
			Элементы.ДатаОтгрузки.Видимость          = Ложь;
			Элементы.ДатаДоставки.Видимость          = Ложь;
			Элементы.ДатаПередачиВДоставку.Видимость = Истина;
			Элементы.ДатаДоставки1.Видимость         = Истина;
			Элементы.ПричинаОтмены.Видимость         = Ложь;
			Элементы.ТрекНомерОтправления.Видимость  = Истина;
		КонецЕсли;
		
		СтатусыПечатиЭтикеток = РегистрыСведений.ЗаказыТорговыхПлощадок.СтатусыПечатиЭтикеток();
		
		Элементы.ПечатьЭтикеток.Видимость = ЗначениеЗаполнено(ДокументЗаказа)
			И СтатусыПечатиЭтикеток.Найти(СтатусОтправления) <> Неопределено;
	КонецЕсли;
	
	Если ЭтоFBO Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияФункциональныхОпций = ИнтеграцияСМаркетплейсамиСервер.ПолучитьФункциональныеОпции(Неопределено);
	ДоступностьКоманд           = ЗначенияФункциональныхОпций.ИспользоватьЗаказыКлиентов
									И ЗначенияФункциональныхОпций.ИспользоватьРасширенныеВозможностиЗаказаКлиента;
	
	Элементы.ЗагрузитьЗаказ.Доступность        = ДоступностьКоманд;
	Элементы.ГруппаКоманднаяПанель.Доступность = ДоступностьКоманд;
	
	Если ИнтеграцияСМаркетплейсамиКлиентСервер.ЭтоЯндексМаркет(ТорговаяПлощадка) Тогда
		Элементы.НаименованиеСклада.Видимость = Ложь;
		Элементы.ГруппаКомандыРаботыСоСпорнымиЗаказами.Видимость = Ложь;
		Элементы.ОтменитьСборку.Видимость = СтатусОтправления = Перечисления.СтатусыЗаказовТорговыхПлощадок.ОжидаетСборки; 
		Элементы.СпособДоставки.Видимость = Ложь;    
		Элементы.ДополнительныеСведения.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТекстДокументыНаОсновании()
	
	Если ЭтоFBO Тогда
		Возврат;
	КонецЕсли;
	
	ТекстыПоляДокументыНаОсновании.Очистить();
	
	// Заказ
	ЕстьПравоИнтерактивногоДобавления = ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы.ЗаказКлиента);
	
	ЕстьЗаказ            = ЗначениеЗаполнено(ДокументЗаказа);
	ЕстьДокументОтгрузки = ЗначениеЗаполнено(ДокументОтгрузки);
	
	НавигационнаяСсылка = "";
	ТекстДокумента      = "";
	
	Элементы.ПодтвердитьСборку.Видимость = ЕстьДокументОтгрузки И СтатусОтправления = Перечисления.СтатусыЗаказовТорговыхПлощадок.ОжидаетСборки;
	Элементы.ОтменитьСборку.Видимость    = СтатусОтправления <> Перечисления.СтатусыЗаказовТорговыхПлощадок.Доставлен
												И СтатусОтправления <> Перечисления.СтатусыЗаказовТорговыхПлощадок.Отменен;
	Элементы.ОтменитьСборку.Заголовок    = ?(СтатусОтправления = Перечисления.СтатусыЗаказовТорговыхПлощадок.ОжидаетСборки,
												НСтр("ru = 'Отменить сборку'"),
												НСтр("ru = 'Отменить доставку'"));
	
	ДоступныеСтатусы = Новый Массив;
	ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗаказовТорговыхПлощадок.ГотовКОтгрузке"));
	ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗаказовТорговыхПлощадок.НеПринятВДоставку"));
	
	Элементы.ОткрытьСпор.Видимость       = ДоступныеСтатусы.Найти(СтатусОтправления) <> Неопределено;
	
	ДоступныеСтатусы = Новый Массив;
	ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗаказовТорговыхПлощадок.Спор"));
	ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗаказовТорговыхПлощадок.НеПринятВДоставку"));
	ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗаказовТорговыхПлощадок.ПередаетсяВДоставку"));
	
	Элементы.ВернутьКОтгрузке.Видимость  = ДоступныеСтатусы.Найти(СтатусОтправления) <> Неопределено;
	
	Если Не ЕстьЗаказ И ЕстьПравоИнтерактивногоДобавления Тогда
		Элементы.ГруппаДанныеОЗаказе.ТекущаяСтраница = Элементы.СтраницаЗагрузитьЗаказ;
	ИначеЕсли Не ЕстьЗаказ Тогда
		Элементы.ГруппаДанныеОЗаказе.ТекущаяСтраница = Элементы.СтраницаТекст;
		ТекстДокумента = НСтр("ru = 'Заказ не загружен'");
	Иначе
		Элементы.ГруппаДанныеОЗаказе.ТекущаяСтраница = Элементы.СтраницаТекст;
		НавигационнаяСсылка = "ОткрытьЗаказ";
		РеквизитыЗаказа     = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументЗаказа, "Номер, Дата");
		ТекстДокумента      = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Заказ клиента № %1 от %2'"),
			ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыЗаказа.Номер),
			Формат(РеквизитыЗаказа.Дата, "ДЛФ=DD"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НавигационнаяСсылка) Тогда
		ЦветТекста = ЦветаСтиля.ГиперссылкаЦвет;
	Иначе
		ЦветТекста = Неопределено;
	КонецЕсли;
	
	ПредставлениеДокумента = Новый ФорматированнаяСтрока(ТекстДокумента,, ЦветТекста,, НавигационнаяСсылка);
	ТекстыПоляДокументыНаОсновании.Добавить(ПредставлениеДокумента);
	
	// Документ отгрузки
	Если ЕстьЗаказ Тогда
		Если ЕстьДокументОтгрузки Тогда
			Если ТипЗнч(ДокументОтгрузки) = Тип("СписокЗначений") Тогда
				Для Каждого ЭлементКоллекции Из ДокументОтгрузки Цикл
					Шаблон = ИнтеграцияСМаркетплейсамиКлиентСервер.ШаблонНавигационнойСсылкиДокументаОтгрузки(ЭлементКоллекции.Значение, СтатусОтправления);
					
					НавигационнаяСсылка = "ОткрытьДокументОтгрузки" + Формат(ДокументОтгрузки.Индекс(ЭлементКоллекции), "ЧН=; ЧГ=0");
					РеквизитыОтгрузки   = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлементКоллекции.Значение, "Номер, Дата");
					ТекстДокумента      = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						Шаблон,
						ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыОтгрузки.Номер),
						Формат(РеквизитыОтгрузки.Дата, "ДЛФ=DD"));
			
					ПредставлениеДокумента = Новый ФорматированнаяСтрока(ТекстДокумента,, ЦветаСтиля.ГиперссылкаЦвет,, НавигационнаяСсылка);
					ТекстыПоляДокументыНаОсновании.Добавить(ПредставлениеДокумента);
				КонецЦикла;
				
			Иначе
				Шаблон = ИнтеграцияСМаркетплейсамиКлиентСервер.ШаблонНавигационнойСсылкиДокументаОтгрузки(ДокументОтгрузки, СтатусОтправления);
				
				НавигационнаяСсылка = "ОткрытьДокументОтгрузки";
				РеквизитыОтгрузки   = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОтгрузки, "Номер, Дата");
				ТекстДокумента      = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					Шаблон,
					ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыОтгрузки.Номер),
					Формат(РеквизитыОтгрузки.Дата, "ДЛФ=DD"));
		
				ПредставлениеДокумента = Новый ФорматированнаяСтрока(ТекстДокумента,, ЦветаСтиля.ГиперссылкаЦвет,, НавигационнаяСсылка);
				ТекстыПоляДокументыНаОсновании.Добавить(ПредставлениеДокумента);
			КонецЕсли;
			
		Иначе
			НавигационнаяСсылка = "ЗаполнитьИРаспределить";
			ТекстДокумента      = НСтр("ru = 'Оформить реализацию для подтверждения сборки'");
			
			ПредставлениеДокумента = Новый ФорматированнаяСтрока(ТекстДокумента,, ЦветаСтиля.ГиперссылкаЦвет,, НавигационнаяСсылка);
			ТекстыПоляДокументыНаОсновании.Добавить(ПредставлениеДокумента);
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияУТКлиентСервер.ОбновитьТекстДокументыНаОсновании(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьДокументыFBS()
	
	ДокументЗаказа   = Документы.ЗаказКлиента.ПустаяСсылка();
	ДокументОтгрузки = Неопределено;
	
	ДокументОтгрузкиВЗаказах =
		ИнтеграцияСМаркетплейсамиСервер.ТребуетсяУказаниеДокументаОтгрузкиВЗаказахТорговыхПлощадок(ТорговаяПлощадка);
	
	Тексты = Новый Массив; // Массив из Строка
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЗаказыТорговыхПлощадок.НомерЗаказа КАК НомерЗаказа,
		|	ЗаказыТорговыхПлощадок.НомерОтправления КАК НомерОтправления,
		|	ЗаказыТорговыхПлощадок.НомерРодительскогоОтправления КАК НомерРодительскогоОтправления,
		|	ЗаказыТорговыхПлощадок.Статус КАК СтатусОтправления,
		|	ЗаказыТорговыхПлощадок.Заказ КАК Заказ,
		|	ЕСТЬNULL(ДокументЗаказКлиента.ПометкаУдаления, ИСТИНА) КАК ЗаказКлиентаПометкаУдаления,
		|	ЗаказыТорговыхПлощадок.ДокументОтгрузки КАК ДокументОтгрузки
		|ПОМЕСТИТЬ ВТВсеЗаказы
		|ИЗ
		|	РегистрСведений.ЗаказыТорговыхПлощадок КАК ЗаказыТорговыхПлощадок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДокументЗаказКлиента
		|		ПО ЗаказыТорговыхПлощадок.Заказ = ДокументЗаказКлиента.Ссылка
		|ГДЕ
		|	ЗаказыТорговыхПлощадок.НомерЗаказа = &НомерЗаказа
		|	И ЗаказыТорговыхПлощадок.УчетнаяЗапись = &УчетнаяЗапись
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ,
		|	ДокументОтгрузки";
	
	Тексты.Добавить(ТекстЗапроса);
	
	Если ДокументОтгрузкиВЗаказах Тогда
		ТекстЗапроса =
			"ВЫБРАТЬ
			|	ВсеЗаказы.НомерЗаказа КАК НомерЗаказа,
			|	ВсеЗаказы.НомерОтправления КАК НомерОтправления,
			|	ВсеЗаказы.СтатусОтправления КАК СтатусОтправления,
			|	ВсеЗаказы.Заказ КАК Заказ,
			|	ВсеЗаказы.ЗаказКлиентаПометкаУдаления КАК ЗаказКлиентаПометкаУдаления,
			|	ВсеЗаказы.ДокументОтгрузки КАК ДокументОтгрузки
			|ИЗ
			|	ВТВсеЗаказы КАК ВсеЗаказы
			|ГДЕ
			|	ВсеЗаказы.НомерОтправления = &НомерОтправления
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВсеЗаказы.НомерЗаказа,
			|	ВсеЗаказы.НомерРодительскогоОтправления,
			|	ВсеЗаказы.СтатусОтправления,
			|	ВсеЗаказы.Заказ,
			|	ВсеЗаказы.ЗаказКлиентаПометкаУдаления,
			|	ВсеЗаказы.ДокументОтгрузки
			|ИЗ
			|	ВТВсеЗаказы КАК ВсеЗаказы
			|ГДЕ
			|	ВсеЗаказы.НомерРодительскогоОтправления = &НомерОтправления";
	Иначе
		ТекстЗапроса =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВсеЗаказы.НомерЗаказа КАК НомерЗаказа,
			|	ЕСТЬNULL(ДанныеРегистра.НомерОтправления, ВсеЗаказы.НомерОтправления) КАК НомерОтправления,
			|	ВсеЗаказы.СтатусОтправления КАК СтатусОтправления,
			|	ВсеЗаказы.Заказ КАК Заказ,
			|	ВсеЗаказы.ЗаказКлиентаПометкаУдаления КАК ЗаказКлиентаПометкаУдаления,
			|	ЕСТЬNULL(ДанныеРегистра.ДокументОтгрузки, НЕОПРЕДЕЛЕНО) КАК ДокументОтгрузки
			|ИЗ
			|	ВТВсеЗаказы КАК ВсеЗаказы
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведенияПоТоварамЗаказовТорговыхПлощадок КАК ДанныеРегистра
			|		ПО ВсеЗаказы.Заказ = ДанныеРегистра.Заказ
			|			И (ДанныеРегистра.НомерРодительскогоОтправления = &НомерОтправления)";
	КонецЕсли;
	
	Тексты.Добавить(ТекстЗапроса);
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());
	Запрос.УстановитьПараметр("УчетнаяЗапись",    УчетнаяЗапись);
	Запрос.УстановитьПараметр("НомерЗаказа",      НомерЗаказа);
	Запрос.УстановитьПараметр("НомерОтправления", НомерОтправления);
	
	УстановитьПривилегированныйРежим(Истина);
	ВыборкаДанных = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока ВыборкаДанных.Следующий() Цикл
		СтатусОтправления = ВыборкаДанных.СтатусОтправления;
		Если Не ВыборкаДанных.ЗаказКлиентаПометкаУдаления Тогда
			ДокументЗаказа = ВыборкаДанных.Заказ;
			Если ЗначениеЗаполнено(ВыборкаДанных.ДокументОтгрузки) Тогда
				Если ТипЗнч(ДокументОтгрузки) = Тип("СписокЗначений") Тогда
					ДокументОтгрузки.Добавить(ВыборкаДанных.ДокументОтгрузки);
				ИначеЕсли ЗначениеЗаполнено(ДокументОтгрузки) Тогда
					ПервыйДокументОтгрузки = ДокументОтгрузки;
					ДокументОтгрузки = Новый СписокЗначений;
					ДокументОтгрузки.Добавить(ПервыйДокументОтгрузки);
					ДокументОтгрузки.Добавить(ВыборкаДанных.ДокументОтгрузки);
				Иначе
					ДокументОтгрузки = ВыборкаДанных.ДокументОтгрузки;
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			ДокументЗаказа   = Документы.ЗаказКлиента.ПустаяСсылка();
			ДокументОтгрузки = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

#КонецОбласти
